# ## Почувствуй себя сеньором*
# 31. Задать массив из 8 элементов и вывести их на экран
# 32. Задать массив из 8 элементов, заполненных нулями и единицами вывести их на экран
# 33. Задать массив из 12 элементов, заполненных числами из [0,9]. Найти сумму положительных/отрицательных элементов массива
# 34. Написать программу замену элементов массива на противоположные

# list = [2, 22, 332, 45]

# for i in range(0, len(list)):
#     list[i] *= -1

# print(list)

# 35. Определить, присутствует ли в заданном массиве, некоторое число
# 36. Задать массив, заполнить случайными положительными трёхзначными числами. Показать количество нечетных\четных чисел
# 37. В одномерном массиве из 123 чисел найти количество элементов из отрезка [10,99]
# 38. Найти сумму чисел одномерного массива стоящих на нечетной позиции
# 39. Найти произведение пар чисел в одномерном массиве. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# 40. В Указанном массиве вещественных чисел найдите разницу между максимальным и минимальным элементом

# ## Почувствуй себя лидом*
# 41. Выяснить являются ли три числа сторонами треугольника
# 42. Определить сколько чисел больше 0 введено с клавиатуры
# 43. Написать программу преобразования десятичного числа в двоичное
# 44. Найти точку пересечения двух прямых заданных уравнением y = k1 * x + b1, y = k2 * x + b2, b1 k1 и b2 и k2 заданы
# 45. Показать числа Фибоначчи
# 46. Написать программу масштабирования фигуры
# ```
# Тут для тех кто далеко улетел, чтобы задавались вершины фигуры списком (одной строкой)
# например: "(0,0) (2,0) (2,2) (0,2)"
# коэффициент масштабирования k задавался отдельно - 2 или 4 или 0.5
# В результате показать координаты, которые получатся.
# при k = 2 получаем "(0,0) (4,0) (4,4) (0,4)"
# ```
# 47. Написать программу копирования массива
